СкладГП/src/InformationRegisters/ИсторияРаботы/ИсторияРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияРаботы</name>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonModules/ИсторияРаботы/Module.bsl
#Область ПрограммныйИнтерфейс
// М запись истории.
// 
// Параметры:
//  ИмяСобытия - Строка - Имя события
//  Примечание - Строка - Примечание
//  Ошибка - Булево - Ошибка
Процедура мЗаписьИстории(ИмяСобытия, Примечание = "", Ошибка = ЛОЖЬ) Экспорт
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРаботы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяСобытия = ИмяСобытия;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	МенеджерЗаписи.Ошибка = Ошибка;
	МенеджерЗаписи.Примечание = Примечание;
	МенеджерЗаписи.Записать(ИСТИНА);
	
КонецПроцедуры
#КонецОбласти
